package Config;

import org.jsoup.Jsoup;
import org.jsoup.nodes.Document;
import org.jsoup.select.Elements;
import java.io.IOException;
import java.util.ArrayList;

public class Storage {
    private ArrayList<String> quoteList;
    Storage()
    {
        //parser("https://vseosvita.ua/user/id1710594/blog/tsikavi-ta-nadykhaiuchi-tsytaty-vidomykh-liudei-81607.html");
        quoteList = new ArrayList<>();
        quoteList.add("Починати завжди варто з того, що сіє сумніви. \n\nБорис Стругацький.");
        quoteList.add("80% успіху - це з'явитися у потрібному місці у потрібний час. \n\nВуді Аллен");
        quoteList.add("Ми маємо визнати очевидне: розуміють лише ті, хто хоче зрозуміти. \n\nБернар Вербер");
        quoteList.add("Почніть робити те, що потрібно. Потім робіть те, що можливо. І ви раптом виявите, що робите неможливе. \n\nСв.Франциск Асізський");
        quoteList.add("Ніщо не є більш обтяжливим для мудрої людини і ніщо не доставляє йому більшого занепокоєння, ніж необхідність витрачати на дрібниці і непотрібні речі більше часу, ніж вони того заслуговують. \n\nПлатон");
        quoteList.add("Кращий спосіб почати робити – перестати говорити і почати робити. \n\nУолт Дісней");
        quoteList.add("Ваш час обмежений, не витрачайте його, проживаючи чуже життя. Не попадайтеся на гачок віровчення, яке існує на уявленнях інших людей. Не дозволяйте поглядам інших заглушати свій власний внутрішній голос. І дуже важливо мати мужність слідувати своєму серцю та інтуїції. Вони, так чи інакше, вже знають, що ви дійсно хочете зробити. Все інше – другорядне. \n\nСтів Джобс");
        quoteList.add("Ваш мозок може все. Абсолютно все. Головне, переконати себе в цьому. Руки не знають, що вони не вміють віджиматися, ноги не знають, що вони слабкі. Це знає ваш мозок. Переконавши себе в тому, що ви можете все, ви зможете дійсно все. \n\nРоберт Кіосакі");
        quoteList.add("Ви отримуєте від життя лише те, що наважуєтеся попросити. Не бійтеся підвищувати планку. \n\nОпра Уїнфрі");
        quoteList.add("Неспроможність робити великі речі немає нічого спільного з розумом. Вона має спільне лише з рішучістю. \n\nМарк Твен");
        quoteList.add("Навіть якщо ви летите на крилах, пам’ятайте, що ноги завжди мають торкатися землі. \n\nПауло Коельйо");
        quoteList.add("Те, що людина може мріяти, вона може досягти. \n\nНаполеон Хілл");
        quoteList.add("Успіх – це те, що ви робите, сприймаючи себе переможцем. \n\nДеніел Вудрелл");
        quoteList.add("Найкращий спосіб передбачити майбутнє — створити його. \n\nАбрахам Лінкольн");
        quoteList.add("У двох словах я можу підсумувати все, що я дізнався про життя: воно триває. \n\nРоберт Фрост");
        quoteList.add("Будьте собою; всі інші вже зайняті. \n\nОскар Уайльд");
        quoteList.add("Ви живете лише один раз, але якщо ви робите це правильно, то і одного разу достатньо. \n\nМей Вест");
        quoteList.add("Не варто зациклюватися на мріях і забувати жити. \n\nДжоан Роулінг");
        quoteList.add("Найбільша слава в житті полягає не в тому, щоб ніколи не падати, а в тому, щоб підніматися кожного разу, коли ми падаємо. \n\nНельсон Мандела");
        quoteList.add("Подорож у тисячу миль починається з одного кроку. \n\nЛао-цзи");
        quoteList.add("Найкращі речі в житті безкоштовні. \n\nАвтор невідомий");
        quoteList.add("Якщо спочатку у вас не виходить, спробуйте ще раз. \n\nВільям Едвард Хіксон");
        quoteList.add("Життя — це 10% того, що з тобою відбувається, і 90% того, як ти на це реагуєш. \n\nЧарльз Р. Свіндолл");
        quoteList.add("Мета нашого життя — бути щасливими. \n\nДалай Лама");
        quoteList.add("Життя — це не проблема, яку потрібно вирішити, а реальність, яку потрібно відчути. \n\nСьорен К’єркегор");
        quoteList.add("Найбільша пригода, на яку можна піти, — це жити життям своєї мрії. \n\nОпра Вінфрі");
        quoteList.add("Найголовніше — насолоджуватися своїм життям — бути щасливим — це все, що має значення. \n\nОдрі Хепберн");
        quoteList.add("Ви живете лише один раз, але якщо ви робите це правильно, одного разу достатньо. \n\nМей Вест");
        quoteList.add("Життя полягає не в тому, щоб знайти себе, а в тому, щоб створити себе. \n\nДжордж Бернард Шоу");
        quoteList.add("Два найважливіших дні у вашому житті — це день, коли ви народилися, і день, коли ви дізналися, чому. \n\nМарк Твен");
        quoteList.add("Неважливо, як повільно ти йдеш, поки ти не зупиняєшся. \n\nКонфуцій");
        quoteList.add("У всьому є краса, але не всі можуть побачити. \n\nКонфуцій");
        quoteList.add("Життя схоже на їзду на велосипеді, щоб зберегти рівновагу, ти повинен продовжувати рухатися. \n\nАльберт Ейнштейн");
        quoteList.add("Якби життя було передбачуваним, воно перестало б бути життям і залишилося б без смаку \n\nЕлеонора Рузвельт");
        quoteList.add("Життя полягає не в тому, щоб отримувати і мати, а в тому, щоб віддавати і бути. \n\nКевін Круз");
        quoteList.add("Успіх не остаточний; невдача не фатальна: має значення мужність продовжувати. \n\nВінстон Черчилль");
        quoteList.add("Якщо ви хочете чогось нового, ви повинні припинити робити щось старе. \n\nПітер Друкер");
        quoteList.add("Життя полягає не в тому, щоб чекати, поки мине шторм; це в тому, щоб навчитися танцювати під дощем. \n\nВівіан Грін");

    }

    String getRandQuote()
    {
        //получаем случайное значение в интервале от 0 до самого большого индекса
        int randValue = (int)(Math.random() * quoteList.size());
        //Из коллекции получаем цитату со случайным индексом и возвращаем ее
        return quoteList.get(randValue);
    }

    // можно "добыть" цитаты из сайта, но распознать их не всегда удается
    void parser(String strURL)
    {
        String className = "v-new-content v-blog-content";
        Document doc = null;
        try {
            doc = Jsoup.connect(strURL).maxBodySize(0).get();
        } catch (IOException e) {
            e.printStackTrace();
        }
        Elements elQuote = doc.getElementsByClass(className);
        elQuote.forEach(el -> {
            quoteList.add(el.text());
        });
    }
}